---
title: PipingFailures
classe: Autodesk.Revit.DB.BuiltInFailures+PipingFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 11
---

# PipingFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CannotCreateGeometryForPipe { get; }` | `PipingFailures.CannotCreateGeometryForPipe` | FailureDefinitionId |
| `FailureDefinitionId CircularLoopInPipeSizing { get; }` | `PipingFailures.CircularLoopInPipeSizing` | FailureDefinitionId |
| `FailureDefinitionId DuctPipeModified { get; }` | `PipingFailures.DuctPipeModified` | FailureDefinitionId |
| `FailureDefinitionId DuctPipeSizeMismatch { get; }` | `PipingFailures.DuctPipeSizeMismatch` | FailureDefinitionId |
| `FailureDefinitionId FabFittingFailed { get; }` | `PipingFailures.FabFittingFailed` | FailureDefinitionId |
| `FailureDefinitionId InvalidPipeSize { get; }` | `PipingFailures.InvalidPipeSize` | FailureDefinitionId |
| `FailureDefinitionId MaxPipeSizeReached { get; }` | `PipingFailures.MaxPipeSizeReached` | FailureDefinitionId |
| `FailureDefinitionId PartNotFoundDueToNoPipeConnectedError { get; }` | `PipingFailures.PartNotFoundDueToNoPipeConnectedError` | FailureDefinitionId |
| `FailureDefinitionId PartNotFoundDueToNoPipeConnectedWarning { get; }` | `PipingFailures.PartNotFoundDueToNoPipeConnectedWarning` | FailureDefinitionId |
| `FailureDefinitionId PartNotFoundInRoutingPreferenceError { get; }` | `PipingFailures.PartNotFoundInRoutingPreferenceError` | FailureDefinitionId |
| `FailureDefinitionId PartNotFoundInRoutingPreferenceWarning { get; }` | `PipingFailures.PartNotFoundInRoutingPreferenceWarning` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```